p="012345"
print(p[0:3])
try:
    anwer = input("เลขฉลากหวยของคุณ : ")
    if anwer =="981417":
        print("**ถูกหวยรางวัลที่ 1**")
    if anwer[0:3] =="287" or anwer[0:3] =="242" :
        print("**เลขหน้า 3 ตัว รางวัล 4000 บาท**")
    if anwer[3:] =="002" or anwer[3:] =="542" :
        print("**เลขท้าย 3 ตัว รางวัล 4000 บาท**")
    if anwer[4:] =="61" :
        print("**เลขท้าย 2 ตัว รางวัล 2000 บาท**")
    if anwer =="981416" or anwer =="981418":
        print("**ถูกหวยข้างเคียงรางวัลที่ 1**")
    if anwer =="953174" or anwer =="196793" or anwer =="587134" or anwer =="201415" or anwer =="592830":
        print("**ถูกหวยรางวัลที่ 2**")
    if anwer =="777700" or anwer =="624057" or anwer =="332670" or anwer =="008704":
        print("**ถูกหวยรางวัลที่ 3**")
    if anwer =="985514" or anwer =="354561" or anwer =="346509" or anwer =="701139":
        print("**ถูกหวยรางวัลที่ 3**")
    if anwer =="638824" or anwer =="860770":
        print("**ถูกหวยรางวัลที่ 3**")
    if anwer =="985514" or anwer =="354561" or anwer =="346509" or anwer =="701139":
        print("**ถูกหวยรางวัลที่ 4**")  
except Exception as e:
    print(e)

'''
try:
 n=int(input("ขออนุญาตสอบถามรายได้ของผู้ใช้งานเพื่อแจ้งว่าคุณต้องทำบัตรอะไร?  : "))
 if n>=15000:
     if n>=15000 and n<= 70000:
         print("คุณสามารถทำบัตรเงินได้")
     elif n>=70001 and n<= 100000:
         print("คุณสามารถทำบัตรทองได้")
     elif n>= 100000:
         print("คุณสามารถทำบัตรแพทตินัมได้")
 else:
     print("คุณมีรายได้ต่ำกว่า 15,000 จึงไม่สามารถทำบัตรได้")
except Exception as e:
 print(e)
'''